#include <stdio.h>


/*
 *4. 数组与指针
 *
 *    数组元素的指针：
 *    a. 一个变量有地址，一个数组包含若干元素，每个数组元素都有相应的地址
 *    b. 指针变量可以指向数组元素（把某一元素的地址放到一个指针变量中）
 *    c. 所谓数组元素的指针就是数组元素的地址
 *
 */

int main(void)
{
    int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int *p = NULL;

    //a是int *类型的   a是指向int 类型
    //a + 1 --->  a + sizeof(int)
    printf("a = %p  a + 1 = %p  a + 2 = %p  a + 3 = %p\n", a, a + 1, a + 2, a + 3);

    p = a;
    //警告：从不兼容的指针类型赋值
    //p = &a;
    printf("p = %p  p + 1 = %p  p + 2 = %p  p + 3 = %p\n", p, p + 1, p + 2, p + 3);

    //访问一个数组的元素有两种方法: 下标法和指针法
    //*(a + i) 与a[i]等价
    printf("*a = %d  *(a + 1) = %d  a[0] = %d  a[1] = %d\n", *a, *(a + 1), a[0], a[1]);
    //*(a + i) 与 *(p + i) 等价
    printf("*p = %d *(p + 1) = %d  *a = %d  *(a + 1): %d\n", *p, *(p + 1), *a, *(a + 1));

    return 0;
}
