#include <stdio.h>

/*
 *    引用数组元素时指针的运算:
 *    在指针指向数组元素时，允许以下运算：
 *    a. 加一个整数(用+或+=)，如p+1
 *    b. 减一个整数(用-或-=)，如p-1
 *    c. 自加运算，如p++，++p
 *    d. 自减运算，如p--，--p
 *    e. 两个指针相减，如p1-p2 (只有p1和p2都指向同一数组中的元素时才有意义)
 *
 */

int main(void)
{
    int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int b;
    int *p = a;
    int *p2 = &a[9];
    //int *p2 = &b;

    // 9 * 4 = 36    
    // p2 - p 只有p2和p都指向同一个数组中的元素的时候，就返回他们之间元素的个数
    printf("p2 - p = %d\n", p2 - p);

    p++;
    //错误：自增运算中的左值无效
    //a++;
    
    //通过指针遍历数组的方式
    //for (p = a; p <= &a[9]; p++)
    //for (p = a; p <= a + 9; p++)
    //p++  等价于 p + sizeof(类型)
    //p + n 等价于 p + n * sizeof(类型)
    for (p = a; p - a <= 9; p++)
    {
        printf("%2d  ", *p); 
    }
    putchar('\n');

    printf("============================\n");
    //for (p = a + 9; p >= a; p--)
    for (p = a + 9; p >= a; p -= 1)
    {
        printf("%2d  ", *p); 
    }
    putchar('\n');
    

    return 0;
}
