#include <stdio.h>

//数组的初始化
int main(void)
{
    int i;
    //定义也是错误的
    //错误：可变大小的对象不能被初始化
    //scanf("%d", &i);
    //int a[i] = {0};

    //定义了一个数组，没有初始化，但是默认为随机数
    int a[10];
    //定义一个数组,将所有的元素初始化为0
    int b[20] = {0}; //int b[20] = {};等价
    //定义了一个数组，将第0个元素初始化为8,后面的元素的值都默认为0
    int c[10] = {8};
    //定义一个数组,将前面四个元素初始化为1,2,3,4  元素之间用逗号分隔 
    int d[10] = {1, 2, 3, 4};
    //长度为0的数组, 不推荐, 错误的用法 sizeof(e): 0;
    int e[] = {};

    //定义了一个数组,并且用1,2,3,4,5初始化,元素个数根据后面初始化的个数决定
    //sizeof(f): 20  ----> 5 * 4 = 20
    int f[] = {1, 2, 3, 4, 5};

    //sizeof(a) 数组占用多少个字节
    //sizeof(a[0])  a[0]占多少个字节
    printf("sizeof(a): %d\n", sizeof a);
    printf("sizeof(e): %d\n", sizeof(e));
    printf("sizeof(f): %d\n", sizeof(f));

    //数组的引用 遍历数组
    //C语言中的数组不能整体输出,必须通过循环一个一个元素的访问
    //printf("%d", a); //a为数组名,打印数组的首地址
    for(i = 0; i < 10; i++)
    {
        printf("%d  ", a[i]); 
    }
    printf("\n=========================\n");

    for (i = 0; i < 20; i++)
    {
        printf("%d ", b[i]); 
    }
    printf("\n=========================\n");

    for (i = 0; i < 10; i++)
    {
        printf("%d ", c[i]);
    }
    printf("\n=========================\n");
    for (i = 0; i < 10; i++)
    {
        printf("%d ", d[i]); 
    }
    printf("\n=========================\n");

    return 0;
}
