#include <stdio.h>

int main(void)
{
    // [] 数组下标访问符
    //数组名为a 有10个元素  每个元素的类型为int
    //a代表数组的首地址
    int a[10];
    int b[10];


    //说明数组名不是变量
    //a = b; //错误：赋值时类型不兼容
    
    // 数组中所有元素的地址是连续
    //&a[0]就是去a[0]的地址, &a[0]与a在数值上是等价
    //a是代表整个数组的首地址, &a也是一个地址, a与&a只是加一个数字之后的值不一样
    printf("a = %p  &a = %p\n", a, &a);
    printf("a + 1 = %p  &a + 1 = %p\n", a + 1, &a + 1);
    printf("a = %p  &a[0] = %p\n", a, &a[0]);
    printf("a + 1 = %p  &a[0] + 1 = %p\n", a + 1, &a[0] + 1);

    printf("===========================\n");
    printf("&a[1]: %p  a + 1: %p\n", &a[1], a + 1);
    printf("&a[2]: %p  a + 2: %p\n", &a[2], a + 2);
    printf("&a[9]: %p  a + 9: %p\n", &a[9], a + 9);

    return 0;
}
