#include <stdio.h>

int main(void)
{
    int i, j;

    //一般的初始化方法
    //int a[2][3] = {1, 2, 3, 4, 5, 6};
    //看作两个数组 a[0], a[1] 然后分别初始化
    //int a[2][3] = {{1, 2, 3}, {4, 5, 6}};

    //第一维可以省略，第二维不可以省略
    //如果初始化的元素少于，则后面的元素默认为0,以下两种方式等价
    //int a[][3] = {1, 2, 3, 4, 5, 6, 7, 8};
    int a[][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8}};

    //初始化一定要按照顺序进行初始化
    int b[3][3] = {{1}, {0, 3}, {0, 0, 5}};

    // {}代表c[1]都初始化为0
    int c[3][3] = {{1}, {}, {0, 2}};

    //二维数组的遍历
    for (i = 0; i < 3; i++)
    {
        //第二维
        for (j = 0; j < 3; j++) 
        {
            //通过下标引用数组
            printf("%d  ", a[i][j]); 
        }
        putchar('\n');
    }
    printf("=====================\n");
    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++) 
        {
            //printf("%d  ", b[i][j]); 
            printf("%d  ", c[i][j]); 
        }
        putchar('\n');
    }

    return 0;
}
